---
kind: type
id: T:Autodesk.Revit.DB.ModelCurveNode
source: html/025d9b39-a253-8f5c-2988-664f089e8cab.htm
---
# Autodesk.Revit.DB.ModelCurveNode

A base class of output nodes that represent various model curves.

## Syntax (C#)
```csharp
public class ModelCurveNode : RenderNode
```